{"license":"","file_hash":null,"name":"BumbleBee","version":"2019.2.0","description":"Dynamo 2.0.1 - Dynamo and Excel Interop developed by Konrad K. Sobon. Instructions and totorials can be found at www.archi-lab.net. This is an open source project with GitHub page: https://github.com/ksobon/Bumblebee as well as an open source primer: https://github.com/ksobon/BumblebeePrimer. You can read the primer here: http://konradsobon.gitbooks.io/bumblebee-primer/content/ ","group":"archi-lab","keywords":["bumblebee","excel","badmonkeys"],"dependencies":[],"contents":"(2) Color Scale Format Condition - This node will generate a two (2) color scheme that can be used to format a range of numbers in Excel., (3) Color Scale Format Condition - This node will generate a three (3) color scheme that can be used to format a range of numbers in Excel., BB Data - This node is a building block for different modes of writing to Excel files. You can combines this node into a list to write to multiple sheets or use just one to write to a single sheet. , BB Style - This node is a building block for different modes of formatting an Excel file. You can combines this node into a list to apply formatting to multiple ranges or sheets at the same time. , Border Style - This node can be used to change default formatting of Excel cells using Format Excel of Conditionally Format Excel Nodes. , ByRange - This node allows for reading an Excel file by specifying a Range in A1 formatting style \"A1:X11\" or by using a named range. , Cell Index - This node will convert an excel address notation from string format (A1) to index format (1,1)., Cell Value Format Condition - This node creates a format condition based on a cell value. , Chart Style - This node will generate a style that can be used to format a chart., Clear Contents - This node will clear contents or formatting from a range within Excel sheet or an entire sheet. , Conditionally Format Excel - This node will allow you to apply conditional formatting to an Excel document or a specific range within the document., Data Bar Format Condition - This node will generate a Data Bar format condition. Based on range of numbers a small bar will be placed in a cell that graphically represents the value contained within the cell. , Embed Image - This node will embed an image into an Excel document., Expression Format Condition - This node will generate an expression based formatting condition that can be used with Conditionally Format Excel Node., Fill Style - This node generates a Fill Style that can be used for conditional formatting or regular cell formatting., Format Excel - This node will allow you to apply formatting to a specific range within the document. You can format a single range on a single sheet or multiple ranges on multiple sheets at the same time., Get Worksheet Names - This node will query an Excel file and return a list of sheet names that it contains. , Graphic Style - This node will create a graphic style that can be used either for conditional formatting or regular cell formatting. , Image Style - This node generates an image style for images being embedded in a document. , Label Style - This node will generate a style that can be used to format labels on a chart., Legend Style - This node will generate a style to visually format a chart legend. , Line Chart Graph Style - This node controls appearance of the graph area of the chart. In this case it will be the line portion of the Line Chart., Line Chart - This node will generate a Line Chart in Excel., Line Style - This node controls Chart's Line Style ex. Line Chart., Marker Style - This node controls the Marker Style that can be used with charts ex. Line Chart., New File By Template - This node will take a template file and create a new file based on that template. , Pie Chart Graph Style - This node will generate a style that can be used to control appearance of the graph portion of the chart., Pie Chart - This node will generate a new Pie Chart in your currently running session of Excel., Read Excel - This node will read an excel file. You can read an entore sheet contents, read from specific origin cell, read only specific range, or do all of the former for multiple sheets at the same time. , Search Value Get Row - This node will search the Excel Spreadsheet for a single string value and return an entire row of data that this value was found in. For example if key was found at A15 then entire row 15 will be returned., Text Style - This node will generate a text style that can be used to format excel or with conditional formatting., Top/Bottom Percentile Format Condition - This node will generate a Formatting Condition based on the top/bottom ranked values. It can either be top percentile (0-100) or number of top/bottom ranked values (top 10 values for example)., Write Excel - This node will write data to Excel file and based on how your BBData nodes are structured it will either override the exsting file, create a new one and write a single worksheet or write multiple worksheets. ","engine_version":"2.0.1.5065","engine":"dynamo","engine_metadata":"","site_url":"www.archi-lab.net","repository_url":"https://github.com/ksobon/Bumblebee","contains_binaries":true,"node_libraries":["bumblebee, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null","bumblebee.UI, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null"]}